
# Set the clock period constraint for 50MHz (20ns period)
create_clock -period 20.000 [get_ports clk]

# Run Analysis and Optimization commands
# update_timing
# report_timing
